Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCM064.PIC
      <edc:SFRDef edc:_addr="0x1F800080" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="nnnn--nn----nnnn--nnnnnn--nnnnnn" edc:cname="PMD5" edc:desc="" edc:impl="0xf30f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu0--uu----uu00--uuuu00--uuuu00" edc:name="PMD5" edc:nzwidth="0x20" edc:por="xxx0--xx----xx00--xxxx00--xxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3MD" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U4MD" edc:mask="0x1" edc:name="U4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U5MD" edc:mask="0x1" edc:name="U5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U6MD" edc:mask="0x1" edc:name="U6MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3MD" edc:mask="0x1" edc:name="SPI3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4MD" edc:mask="0x1" edc:name="SPI4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI5MD" edc:mask="0x1" edc:name="SPI5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6MD" edc:mask="0x1" edc:name="SPI6MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MD" edc:mask="0x1" edc:name="I2C3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MD" edc:mask="0x1" edc:name="I2C4MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="USB1MD" edc:mask="0x1" edc:name="USB1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USB2MD" edc:mask="0x1" edc:name="USB2MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN1MD" edc:desc="" edc:mask="0x1" edc:name="CAN1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2MD" edc:mask="0x1" edc:name="CAN2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN3MD" edc:mask="0x1" edc:name="CAN3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN4MD" edc:mask="0x1" edc:name="CAN4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800090" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="----nnnn----nn-n----nnnn-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x1fbf1f01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu----uu-u----0000-------0" edc:name="PMD6" edc:nzwidth="0x20" edc:por="----xxxx----xx-x----0000-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:desc="" edc:mask="0x1" edc:name="REFO1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:desc="" edc:mask="0x1" edc:name="REFO2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:desc="" edc:mask="0x1" edc:name="REFO3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:desc="" edc:mask="0x1" edc:name="REFO4MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PMPMD" edc:mask="0x1" edc:name="PMPMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI5MD" edc:mask="0x1" edc:name="QEI5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI6MD" edc:mask="0x1" edc:name="QEI6MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="QEI1MD" edc:mask="0x1" edc:name="QEI1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI2MD" edc:mask="0x1" edc:name="QEI2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI3MD" edc:mask="0x1" edc:name="QEI3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI4MD" edc:mask="0x1" edc:name="QEI4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8000A0" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="---------------------------n----" edc:cname="PMD7" edc:desc="" edc:impl="0x10" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------0----" edc:name="PMD7" edc:nzwidth="0x20" edc:por="---------------------------0----" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMAMD" edc:desc="" edc:mask="0x1" edc:name="DMAMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8000B0" edc:offset="48"/>
      <edc:SFRDef edc:_addr="0x1F8000E0" edc:_begin="0xe0" edc:_end="0x114" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="3" edc:access="------nnnn--------nn------nn--nn" edc:cname="CFGPG" edc:desc="" edc:impl="0x3c03033" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000--------00------00--00" edc:name="CFGPG" edc:nzwidth="32" edc:por="------0000--------00------00--00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUPG" edc:desc="" edc:mask="0x3" edc:name="CPUPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DMAPG" edc:desc="" edc:mask="0x3" edc:name="DMAPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CAN1PG" edc:desc="" edc:mask="0x3" edc:name="CAN1PG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="FCPG" edc:desc="" edc:mask="0x3" edc:name="FCPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCPG" edc:desc="" edc:mask="0x3" edc:name="ADCPG" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
