Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCM064.PIC
      <edc:SFRDef edc:_addr="0x1F860010" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="-------------------nnn-nn--n--nn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------111-11--1--11" edc:name="TRISA" edc:nzwidth="0x20" edc:por="-------------------111-11--1--11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA8" edc:desc="" edc:mask="0x1" edc:name="TRISA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA11" edc:desc="" edc:mask="0x1" edc:name="TRISA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA12" edc:desc="" edc:mask="0x1" edc:name="TRISA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860020" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="-------------------nnn-nn--n--nn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxx-xx--x--xx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="-------------------xxx-xx--x--xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA8" edc:desc="" edc:mask="0x1" edc:name="RA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA11" edc:desc="" edc:mask="0x1" edc:name="RA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA12" edc:desc="" edc:mask="0x1" edc:name="RA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860030" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="-------------------nnn-nn--n--nn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff1d93" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxx-xx--x--xx" edc:name="LATA" edc:nzwidth="0x20" edc:por="-------------------xxx-xx--x--xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA8" edc:desc="" edc:mask="0x1" edc:name="LATA8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA11" edc:desc="" edc:mask="0x1" edc:name="LATA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA12" edc:desc="" edc:mask="0x1" edc:name="LATA12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
