Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCM064.PIC
      <edc:SFRDef edc:_addr="0x1F884A00" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ18" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ18" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A10" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK18" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK18" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A20" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ19" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ19" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A30" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK19" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK19" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A40" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ20" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ20" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A50" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK20" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK20" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A60" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ21" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ1" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A70" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3MASK21" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3MASK1" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884A80" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3FLTOBJ22" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3FLTOBJ22" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
